Ran Plan for 2 projects:

1. dir: `.` workspace: `stage`
1. dir: `.` workspace: `prod`

### 1. dir: `.` workspace: `stage`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.atlantis_statefulset will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "atlantis_statefulset" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
            
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_rsa
                      subPath: id_rsa
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_rsa.pub
                      subPath: id_rsa.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.20.1
                    # command: ["sleep", "360000"]
                    command: ["docker-entrypoint.sh"] 
                    args: 
                      - "server"
-                       "--atlantis-url=http://${atlantis_ip}:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/run0ut/diploma-terraform # 2. Replace this with your own repo allowlist.
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: run0ut # 3. If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items: 
                      - key: ssh
                        path: id_rsa
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_rsa.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
+       vars     = {
+           "atlantis_ip" = (known after apply)
        }
    }

  # data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_node}
            
            [kube_control_plane]
            ${list_master}
            
            [kube_node]
            ${list_node}
            
            [etcd]
            ${list_master}
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
        EOT
+       vars     = {
+           "connection_strings_master" = (known after apply)
+           "connection_strings_node"   = (known after apply)
+           "list_master"               = "diploma-control-stage-0"
+           "list_node"                 = "diploma-worker-stage-0"
        }
    }

  # data.template_file.kubectl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "kubectl" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            ---
            - name: Get kuber credentials
              hosts: diploma-control-${workspace}-0
              become: yes
              gather_facts: yes
              tasks:
                - name: Save host to var
                  set_fact:
                    kube_control_node: "{{ ansible_host }}"
                - name: Print fact
                  debug:
                    var: kube_control_node
            
                - name: Duplicate folder kube
                  copy:
                    src: /etc/kubernetes/admin.conf
                    dest: /etc/kubernetes/admin_export.conf
                    remote_src: yes
                    mode: 0755
            
                - name: Set Kube IP in config
                  replace:
                    path: /etc/kubernetes/admin_export.conf
                    regexp: "server: https://[0-9.]*:"
                    replace: "server: https://{{ kube_control_node }}:"
                - name: Fetch kube config
                  synchronize:
                    src: /etc/kubernetes/admin_export.conf
                    dest: ../kubeconfig/config-${workspace}
                    delete: yes
                    recursive: yes
                    owner: no
                    group: no
                    mode: pull
        EOT
+       vars     = {
+           "workspace" = "stage"
        }
    }

  # data.template_file.supplementary_addresses_in_ssl_keys will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "supplementary_addresses_in_ssl_keys" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            ---
            - name: Allow access by public IP
              hosts: localhost
              become: no
              gather_facts: no
              tasks:
                  - name: Configure option in k8s-cluster.yml
                    replace:
                      path: ../kubespray/inventory/diplomacluster/group_vars/k8s_cluster/k8s-cluster.yml
                      regexp: '^.*supplementary_addresses_in_ssl_keys:.*'
                      replace: "supplementary_addresses_in_ssl_keys: [127.0.0.1, {{ hostvars[\"diploma-control-${workspace}-0\"][\"ansible_host\"] }}]"
        EOT
+       vars     = {
+           "workspace" = "stage"
        }
    }

  # null_resource.app will be created
+ resource "null_resource" "app" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.folder will be created
+ resource "null_resource" "folder" {
+       id = (known after apply)
    }

  # null_resource.git_clone will be created
+ resource "null_resource" "git_clone" {
+       id = (known after apply)
    }

  # null_resource.grafana_public will be created
+ resource "null_resource" "grafana_public" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.inventories will be created
+ resource "null_resource" "inventories" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kube_prometheus will be created
+ resource "null_resource" "kube_prometheus" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubectl will be created
+ resource "null_resource" "kubectl" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubectl_playbook will be created
+ resource "null_resource" "kubectl_playbook" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.kubespray will be created
+ resource "null_resource" "kubespray" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.public_access will be created
+ resource "null_resource" "public_access" {
+       id = (known after apply)
    }

  # null_resource.requirements is tainted, so must be replaced
-/+ resource "null_resource" "requirements" {
!       id = "7890090048836879595" -> (known after apply)
    }

  # null_resource.supplementary_addresses_in_ssl_keys_playbook will be created
+ resource "null_resource" "supplementary_addresses_in_ssl_keys_playbook" {
+       id       = (known after apply)
+       triggers = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
+       id = (known after apply)
    }

  # yandex_compute_instance.control[0] must be replaced
-/+ resource "yandex_compute_instance" "control" {
!       created_at                = "2022-10-17T07:20:02Z" -> (known after apply)
!       folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
!       fqdn                      = "diploma-control-stage-0.local" -> (known after apply)
!       id                        = "fhmjth9v3ooh1vf3ghai" -> (known after apply)
-       labels                    = {} -> null
        name                      = "diploma-control-stage-0"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
!       zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmnvhtlin4nsbu3mpf1" -> (known after apply)
!           disk_id     = "fhmnvhtlin4nsbu3mpf1" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "10.0.0.19" -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:13:ec:53:f1" -> (known after apply)
!           nat_ip_address     = "178.154.221.203" -> (known after apply)
!           nat_ip_version     = "IPV4" -> (known after apply)
!           security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # yandex_compute_instance.worker[0] must be replaced
-/+ resource "yandex_compute_instance" "worker" {
!       created_at                = "2022-10-17T07:20:02Z" -> (known after apply)
!       folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
!       fqdn                      = "diploma-worker-stage-0.local" -> (known after apply)
!       id                        = "fhm4k0osfbetctu1nvek" -> (known after apply)
-       labels                    = {} -> null
        name                      = "diploma-worker-stage-0"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
!       zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhms16l590o6a2sn81hg" -> (known after apply)
!           disk_id     = "fhms16l590o6a2sn81hg" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "10.0.0.11" -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:4a:03:1c:7a" -> (known after apply)
!           nat_ip_address     = "178.154.222.48" -> (known after apply)
!           nat_ip_version     = "IPV4" -> (known after apply)
!           security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

Plan: 15 to add, 0 to change, 3 to destroy.

Changes to Outputs:
! control_nodes = [
-       "name=diploma-control-stage-0, public=178.154.221.203, private=10.0.0.19",
+       (known after apply),
    ]
! worker_nodes  = [
-       "name=diploma-worker-stage-0, public=178.154.222.48, private=10.0.0.11",
+       (known after apply),
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://84.201.135.47:30141/lock?id=run0ut%252Fdiploma-terraform%252F.%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w stage`
</details>
Plan: 15 to add, 0 to change, 3 to destroy.

---
### 2. dir: `.` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.atlantis_statefulset will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "atlantis_statefulset" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
            
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_rsa
                      subPath: id_rsa
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_rsa.pub
                      subPath: id_rsa.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.20.1
                    # command: ["sleep", "360000"]
                    command: ["docker-entrypoint.sh"] 
                    args: 
                      - "server"
-                       "--atlantis-url=http://${atlantis_ip}:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/run0ut/diploma-terraform # 2. Replace this with your own repo allowlist.
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: run0ut # 3. If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items: 
                      - key: ssh
                        path: id_rsa
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_rsa.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
+       vars     = {
+           "atlantis_ip" = (known after apply)
        }
    }

  # data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_node}
            
            [kube_control_plane]
            ${list_master}
            
            [kube_node]
            ${list_node}
            
            [etcd]
            ${list_master}
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
        EOT
+       vars     = {
+           "connection_strings_master" = (known after apply)
+           "connection_strings_node"   = (known after apply)
+           "list_master"               = "diploma-control-prod-0"
+           "list_node"                 = "diploma-worker-prod-0"
        }
    }

  # data.template_file.kubectl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "kubectl" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            ---
            - name: Get kuber credentials
              hosts: diploma-control-${workspace}-0
              become: yes
              gather_facts: yes
              tasks:
                - name: Save host to var
                  set_fact:
                    kube_control_node: "{{ ansible_host }}"
                - name: Print fact
                  debug:
                    var: kube_control_node
            
                - name: Duplicate folder kube
                  copy:
                    src: /etc/kubernetes/admin.conf
                    dest: /etc/kubernetes/admin_export.conf
                    remote_src: yes
                    mode: 0755
            
                - name: Set Kube IP in config
                  replace:
                    path: /etc/kubernetes/admin_export.conf
                    regexp: "server: https://[0-9.]*:"
                    replace: "server: https://{{ kube_control_node }}:"
                - name: Fetch kube config
                  synchronize:
                    src: /etc/kubernetes/admin_export.conf
                    dest: ../kubeconfig/config-${workspace}
                    delete: yes
                    recursive: yes
                    owner: no
                    group: no
                    mode: pull
        EOT
+       vars     = {
+           "workspace" = "prod"
        }
    }

  # null_resource.app must be replaced
-/+ resource "null_resource" "app" {
!       id       = "8878895312955486256" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.atlantis[0] must be replaced
-/+ resource "null_resource" "atlantis" {
!       id       = "6333817556594703803" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.atlantis_configmaps[0] must be replaced
-/+ resource "null_resource" "atlantis_configmaps" {
!       id       = "4900296017482917186" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.atlantis_manifest[0] must be replaced
-/+ resource "null_resource" "atlantis_manifest" {
!       id       = "853367667990374808" -> (known after apply)
!       triggers = {
-           "template" = <<-EOT
                ---
                - name: Get kuber credentials
                  hosts: diploma-control-prod-0
                  become: yes
                  gather_facts: yes
                  tasks:
                    - name: Save host to var
                      set_fact:
                        kube_control_node: "{{ ansible_host }}"
                    - name: Print fact
                      debug:
                        var: kube_control_node
                
                    - name: Duplicate folder kube
                      copy:
                        src: /etc/kubernetes/admin.conf
                        dest: /etc/kubernetes/admin_export.conf
                        remote_src: yes
                        mode: 0755
                
                    - name: Set Kube IP in config
                      replace:
                        path: /etc/kubernetes/admin_export.conf
                        regexp: "server: https://[0-9.]*:"
                        replace: "server: https://{{ kube_control_node }}:"
                    - name: Fetch kube config
                      synchronize:
                        src: /etc/kubernetes/admin_export.conf
                        dest: ../kubeconfig/config-prod
                        delete: yes
                        recursive: yes
                        owner: no
                        group: no
                        mode: pull
            EOT
        } -> (known after apply) # forces replacement
    }

  # null_resource.grafana_public must be replaced
-/+ resource "null_resource" "grafana_public" {
!       id       = "8281035782832920287" -> (known after apply)
!       triggers = {
-           "prometheus_deployed" = "4677182357523670053"
        } -> (known after apply) # forces replacement
    }

  # null_resource.inventories must be replaced
-/+ resource "null_resource" "inventories" {
!       id       = "3035042826661090151" -> (known after apply)
!       triggers = {
-           "template" = <<-EOT
                [all]
                diploma-control-prod-0 ansible_host=84.201.135.47 ansible_user=ubuntu
                diploma-worker-prod-0 ansible_host=130.193.51.237 ansible_user=ubuntu
                
                [kube_control_plane]
                diploma-control-prod-0
                
                [kube_node]
                diploma-worker-prod-0
                
                [etcd]
                diploma-control-prod-0
                
                [k8s_cluster:children]
                kube_node
                kube_control_plane
            EOT
        } -> (known after apply) # forces replacement
    }

  # null_resource.jenkins[0] must be replaced
-/+ resource "null_resource" "jenkins" {
!       id       = "182337362290792648" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.jenkins_configmaps[0] must be replaced
-/+ resource "null_resource" "jenkins_configmaps" {
!       id       = "310209733945547971" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.kube_prometheus must be replaced
-/+ resource "null_resource" "kube_prometheus" {
!       id       = "4677182357523670053" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # null_resource.kubectl must be replaced
-/+ resource "null_resource" "kubectl" {
!       id       = "9201369114862368800" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "3035042826661090151"
        } -> (known after apply) # forces replacement
    }

  # null_resource.kubectl_playbook must be replaced
-/+ resource "null_resource" "kubectl_playbook" {
!       id       = "3251051468066750195" -> (known after apply)
!       triggers = {
-           "template" = <<-EOT
                ---
                - name: Get kuber credentials
                  hosts: diploma-control-prod-0
                  become: yes
                  gather_facts: yes
                  tasks:
                    - name: Save host to var
                      set_fact:
                        kube_control_node: "{{ ansible_host }}"
                    - name: Print fact
                      debug:
                        var: kube_control_node
                
                    - name: Duplicate folder kube
                      copy:
                        src: /etc/kubernetes/admin.conf
                        dest: /etc/kubernetes/admin_export.conf
                        remote_src: yes
                        mode: 0755
                
                    - name: Set Kube IP in config
                      replace:
                        path: /etc/kubernetes/admin_export.conf
                        regexp: "server: https://[0-9.]*:"
                        replace: "server: https://{{ kube_control_node }}:"
                    - name: Fetch kube config
                      synchronize:
                        src: /etc/kubernetes/admin_export.conf
                        dest: ../kubeconfig/config-prod
                        delete: yes
                        recursive: yes
                        owner: no
                        group: no
                        mode: pull
            EOT
        } -> (known after apply) # forces replacement
    }

  # null_resource.kubespray must be replaced
-/+ resource "null_resource" "kubespray" {
!       id       = "8613867658805653058" -> (known after apply)
!       triggers = {
-           "cluster_instance_ids" = "fhm357ps81rnqtvem5kf,fhmj6cb0s5frp99prtql"
        } -> (known after apply) # forces replacement
    }

  # yandex_compute_instance.control[0] must be replaced
-/+ resource "yandex_compute_instance" "control" {
!       created_at                = "2022-10-17T06:21:44Z" -> (known after apply)
!       folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
!       fqdn                      = "diploma-control-prod-0.local" -> (known after apply)
!       id                        = "fhm357ps81rnqtvem5kf" -> (known after apply)
-       labels                    = {} -> null
        name                      = "diploma-control-prod-0"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
!       zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmeo39trnc28pn402ve" -> (known after apply)
!           disk_id     = "fhmeo39trnc28pn402ve" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "10.0.0.4" -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:32:9f:3c:40" -> (known after apply)
!           nat_ip_address     = "84.201.135.47" -> (known after apply)
!           nat_ip_version     = "IPV4" -> (known after apply)
!           security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # yandex_compute_instance.worker[0] must be replaced
-/+ resource "yandex_compute_instance" "worker" {
!       created_at                = "2022-10-17T06:21:45Z" -> (known after apply)
!       folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
!       fqdn                      = "diploma-worker-prod-0.local" -> (known after apply)
!       id                        = "fhmj6cb0s5frp99prtql" -> (known after apply)
-       labels                    = {} -> null
        name                      = "diploma-worker-prod-0"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
!       zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmjno534013jsintaun" -> (known after apply)
!           disk_id     = "fhmjno534013jsintaun" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "10.0.0.5" -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:13:33:16:0e" -> (known after apply)
!           nat_ip_address     = "130.193.51.237" -> (known after apply)
!           nat_ip_version     = "IPV4" -> (known after apply)
!           security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 14 to destroy.

Changes to Outputs:
! control_nodes = [
-       "name=diploma-control-prod-0, public=84.201.135.47, private=10.0.0.4",
+       (known after apply),
    ]
! worker_nodes  = [
-       "name=diploma-worker-prod-0, public=130.193.51.237, private=10.0.0.5",
+       (known after apply),
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://84.201.135.47:30141/lock?id=run0ut%252Fdiploma-terraform%252F.%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w prod`
</details>
Plan: 14 to add, 0 to change, 14 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
